ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/rtc_c.xml
<module id="RTC_C" HW_revision=""><register id="CTL0" width="16" offset="0x0" internal="0" description="RTCCTL0 Register"><bitfield id="RDYIFG" description="Real-time clock ready interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="AIFG" description="Real-time clock alarm interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="TEVIFG" description="Real-time clock time event interrupt flag" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="OFIFG" description="32-kHz crystal oscillator fault interrupt flag" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="RDYIE" description="Real-time clock ready interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="AIE" description="Real-time clock alarm interrupt enable" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="TEVIE" description="Real-time clock time event interrupt enable" begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="OFIE" description="32-kHz crystal oscillator fault interrupt enable" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="KEY" description="Real-time clock key" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="CTL13" width="16" offset="0x2" internal="0" description="RTCCTL13 Register"><bitfield id="TEV" description="Real-time clock time event" begin="1" end="0" width="2" rwaccess="R/W"><bitenum id="TEV__0" value="0" description="Minute changed"/><bitenum id="TEV__1" value="1" description="Hour changed"/><bitenum id="TEV__2" value="2" description="Every day at midnight (00:00)"/><bitenum id="TEV__3" value="3" description="Every day at noon (12:00)"/></bitfield><bitfield id="SSEL" description="Real-time clock source select." begin="3" end="2" width="2" rwaccess="R/W"><bitenum id="SSEL__0" value="0" description="BCLK"/></bitfield><bitfield id="RDY" description="Real-time clock ready" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="RDY__0" value="0" description="RTC time values in transition"/><bitenum id="RDY__1" value="1" description="RTC time values safe for reading"/></bitfield><bitfield id="MODE" description="" begin="5" end="5" width="1" rwaccess="R/W"><bitenum id="MODE__1" value="1" description="Calendar mode. Always reads a value of 1."/></bitfield><bitfield id="HOLD" description="Real-time clock hold" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="HOLD__0" value="0" description="Real-time clock is operational"/><bitenum id="HOLD__1" value="1" description="When set, the calendar is stopped as well as the prescale count"/></bitfield><bitfield id="BCD" description="Real-time clock BCD select" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="BCD__0" value="0" description="Binary (hexadecimal) code selected"/><bitenum id="BCD__1" value="1" description="Binary coded decimal (BCD) code selected"/></bitfield><bitfield id="CALF" description="Real-time clock calibration frequency" begin="9" end="8" width="2" rwaccess="R/W"><bitenum id="CALF__0" value="0" description="No frequency output to RTCCLK pin"/><bitenum id="CALF__1" value="1" description="512 Hz"/><bitenum id="CALF__2" value="2" description="256 Hz"/><bitenum id="CALF__3" value="3" description="1 Hz"/></bitfield></register><register id="OCAL" width="16" offset="0x4" internal="0" description="RTCOCAL Register"><bitfield id="OCAL" description="Real-time clock offset error calibration" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="OCALS" description="Real-time clock offset error calibration sign" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="OCALS__0" value="0" description="Down calibration. Frequency adjusted down."/><bitenum id="OCALS__1" value="1" description="Up calibration. Frequency adjusted up."/></bitfield></register><register id="TCMP" width="16" offset="0x6" internal="0" description="RTCTCMP Register"><bitfield id="TCMPx" description="Real-time clock temperature compensation" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="TCOK" description="Real-time clock temperature compensation write OK" begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="TCOK__0" value="0" description="Write to RTCTCMPx is unsuccessful"/><bitenum id="TCOK__1" value="1" description="Write to RTCTCMPx is successful"/></bitfield><bitfield id="TCRDY" description="Real-time clock temperature compensation ready" begin="14" end="14" width="1" rwaccess="R/W"/><bitfield id="TCMPS" description="Real-time clock temperature compensation sign" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="TCMPS__0" value="0" description="Down calibration. Frequency adjusted down"/><bitenum id="TCMPS__1" value="1" description="Up calibration. Frequency adjusted up"/></bitfield></register><register id="PS0CTL" width="16" offset="0x8" internal="0" description="Real-Time Clock Prescale Timer 0 Control Register"><bitfield id="RT0PSIFG" description="Prescale timer 0 interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="RT0PSIFG__0" value="0" description="No time event occurred"/><bitenum id="RT0PSIFG__1" value="1" description="Time event occurred"/></bitfield><bitfield id="RT0PSIE" description="Prescale timer 0 interrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="RT0PSIE__0" value="0" description="Interrupt not enabled"/><bitenum id="RT0PSIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="RT0IP" description="Prescale timer 0 interrupt interval" begin="4" end="2" width="3" rwaccess="R/W"><bitenum id="RT0IP__0" value="0" description="Divide by 2"/><bitenum id="RT0IP__1" value="1" description="Divide by 4"/><bitenum id="RT0IP__2" value="2" description="Divide by 8"/><bitenum id="RT0IP__3" value="3" description="Divide by 16"/><bitenum id="RT0IP__4" value="4" description="Divide by 32"/><bitenum id="RT0IP__5" value="5" description="Divide by 64"/><bitenum id="RT0IP__6" value="6" description="Divide by 128"/><bitenum id="RT0IP__7" value="7" description="Divide by 256"/></bitfield></register><register id="PS1CTL" width="16" offset="0xA" internal="0" description="Real-Time Clock Prescale Timer 1 Control Register"><bitfield id="RT1PSIFG" description="Prescale timer 1 interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="RT1PSIFG__0" value="0" description="No time event occurred"/><bitenum id="RT1PSIFG__1" value="1" description="Time event occurred"/></bitfield><bitfield id="RT1PSIE" description="Prescale timer 1 interrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="RT1PSIE__0" value="0" description="Interrupt not enabled"/><bitenum id="RT1PSIE__1" value="1" description="Interrupt enabled (LPM3/LPM3.5 wake-up enabled)"/></bitfield><bitfield id="RT1IP" description="Prescale timer 1 interrupt interval" begin="4" end="2" width="3" rwaccess="R/W"><bitenum id="RT1IP__0" value="0" description="Divide by 2"/><bitenum id="RT1IP__1" value="1" description="Divide by 4"/><bitenum id="RT1IP__2" value="2" description="Divide by 8"/><bitenum id="RT1IP__3" value="3" description="Divide by 16"/><bitenum id="RT1IP__4" value="4" description="Divide by 32"/><bitenum id="RT1IP__5" value="5" description="Divide by 64"/><bitenum id="RT1IP__6" value="6" description="Divide by 128"/><bitenum id="RT1IP__7" value="7" description="Divide by 256"/></bitfield></register><register id="PS" width="16" offset="0xC" internal="0" description="Real-Time Clock Prescale Timer Counter Register"><bitfield id="RT0PS" description="Prescale timer 0 counter value" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="RT1PS" description="Prescale timer 1 counter value" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="IV" width="16" offset="0xE" internal="0" description="Real-Time Clock Interrupt Vector Register"><bitfield id="IV" description="Real-time clock interrupt vector value" begin="15" end="0" width="16" rwaccess="R/W"><bitenum id="IV__0" value="0" description="No interrupt pending"/><bitenum id="IV__2" value="2" description="Interrupt Source: RTC oscillator failure; Interrupt Flag: RTCOF"/><bitenum id="IV__4" value="4" description="Interrupt Source: RTC ready; Interrupt Flag: RTCRDYIFG"/><bitenum id="IV__6" value="6" description="Interrupt Source: RTC interval timer; Interrupt Flag: RTCTEVIFG"/><bitenum id="IV__8" value="8" description="Interrupt Source: RTC user alarm; Interrupt Flag: RTCAIFG"/><bitenum id="IV__16" value="10" description="Interrupt Source: RTC prescaler 0; Interrupt Flag: RT0PSIFG"/><bitenum id="IV__18" value="12" description="Interrupt Source: RTC prescaler 1; Interrupt Flag: RT1PSIFG"/></bitfield></register><register id="TIM0" width="16" offset="0x10" internal="0" description="RTCTIM0 Register – Hexadecimal Format"><bitfield id="SEC" description="Seconds (0 to 59)" begin="5" end="0" width="6" rwaccess="R/W"/><bitfield id="MIN" description="Minutes (0 to 59)" begin="13" end="8" width="6" rwaccess="R/W"/></register><register id="TIM1" width="16" offset="0x12" internal="0" description="Real-Time Clock Hour, Day of Week"><bitfield id="HOUR" description="Hours (0 to 23)" begin="4" end="0" width="5" rwaccess="R/W"/><bitfield id="DOW" description="Day of week (0 to 6)" begin="10" end="8" width="3" rwaccess="R/W"/></register><register id="DATE" width="16" offset="0x14" internal="0" description="RTCDATE - Hexadecimal Format"><bitfield id="DAY" description="Day of month (1 to 28, 29, 30, 31)" begin="4" end="0" width="5" rwaccess="R/W"/><bitfield id="MON" description="Month (1 to 12)" begin="11" end="8" width="4" rwaccess="R/W"/></register><register id="YEAR" width="16" offset="0x16" internal="0" description="RTCYEAR Register – Hexadecimal Format"><bitfield id="YEAR_LB" description="Year – low byte. Valid values for Year are 0 to 4095." begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="YEAR_HB" description="Year – high byte. Valid values for Year are 0 to 4095." begin="11" end="8" width="4" rwaccess="R/W"/></register><register id="AMINHR" width="16" offset="0x18" internal="0" description="RTCMINHR - Hexadecimal Format"><bitfield id="MIN" description="Minutes (0 to 59)" begin="5" end="0" width="6" rwaccess="R/W"/><bitfield id="MINAE" description="Alarm enable" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="HOUR" description="Hours (0 to 23)" begin="12" end="8" width="5" rwaccess="R/W"/><bitfield id="HOURAE" description="Alarm enable" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="ADOWDAY" width="16" offset="0x1A" internal="0" description="RTCADOWDAY - Hexadecimal Format"><bitfield id="DOW" description="Day of week (0 to 6)" begin="2" end="0" width="3" rwaccess="R/W"/><bitfield id="DOWAE" description="Alarm enable" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="DAY" description="Day of month (1 to 28, 29, 30, 31)" begin="12" end="8" width="5" rwaccess="R/W"/><bitfield id="DAYAE" description="Alarm enable" begin="15" end="15" width="1" rwaccess="R/W"/></register><register id="BIN2BCD" width="16" offset="0x1C" internal="0" description="Binary-to-BCD Conversion Register"><bitfield id="BIN2BCD" description="Read: 16-bit BCD conversion of previously written 12-bit binary" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="BCD2BIN" width="16" offset="0x1E" internal="0" description="BCD-to-Binary Conversion Register"><bitfield id="BCD2BIN" description="Read: 12-bit binary conversion of previously written 16-bit BCD" begin="15" end="0" width="16" rwaccess="R/W"/></register></module>